; domain
(define (domain depots)
  (:requirements :typing :strips)
  (:types
    place - object
    depot distributor - place
    locatable - object
    truck hoist surface - locatable
    pallet crate - surface
  )

  (:predicates
    (at ?obj - locatable ?p - place)
    (on ?c - crate ?s - surface)
    (in ?c - crate ?t - truck)
    (lifting ?h - hoist ?c - crate)
    (available ?h - hoist)
    (clear ?s - surface)
  )

  (:action drive
    :parameters (?t - truck ?from - place ?to - place)
    :precondition (at ?t ?from)
    :effect (and
      (not (at ?t ?from))
      (at ?t ?to)
    )
  )

  (:action lift
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?c ?p)
      (at ?s ?p)
      (on ?c ?s)
      (clear ?c)
      (available ?h)
    )
    :effect (and
      (not (at ?c ?p))
      (not (available ?h))
      (not (on ?c ?s))
      (not (clear ?c))
      (lifting ?h ?c)
      (clear ?s)
    )
  )

  (:action drop
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?s ?p)
      (clear ?s)
      (lifting ?h ?c)
    )
    :effect (and
      (at ?c ?p)
      (available ?h)
      (on ?c ?s)
      (not (lifting ?h ?c))
      (not (clear ?s))
      (clear ?c)
    )
  )

  (:action load
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (lifting ?h ?c)
    )
    :effect (and
      (not (lifting ?h ?c))
      (in ?c ?t)
      (available ?h)
    )
  )

  (:action unload
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (available ?h)
      (in ?c ?t)
    )
    :effect (and
      (not (available ?h))
      (not (in ?c ?t))
      (lifting ?h ?c)
    )
  )
)

; problem
(define (problem depot-6-3-3-9-9-4) (:domain depots)
(:objects
	depot0 depot1 depot2 depot3 depot4 depot5 - Depot
	distributor0 distributor1 distributor2 - Distributor
	truck0 truck1 truck2 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 - Pallet
	crate0 crate1 crate2 crate3 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 hoist8 - Hoist)
(:init
	(at pallet0 depot0)
	(clear pallet0)
	(at pallet1 depot1)
	(clear pallet1)
	(at pallet2 depot2)
	(clear crate3)
	(at pallet3 depot3)
	(clear pallet3)
	(at pallet4 depot4)
	(clear pallet4)
	(at pallet5 depot5)
	(clear pallet5)
	(at pallet6 distributor0)
	(clear pallet6)
	(at pallet7 distributor1)
	(clear crate2)
	(at pallet8 distributor2)
	(clear crate0)
	(at truck0 distributor0)
	(at truck1 depot3)
	(at truck2 distributor1)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 depot3)
	(available hoist3)
	(at hoist4 depot4)
	(available hoist4)
	(at hoist5 depot5)
	(available hoist5)
	(at hoist6 distributor0)
	(available hoist6)
	(at hoist7 distributor1)
	(available hoist7)
	(at hoist8 distributor2)
	(available hoist8)
	(at crate0 distributor2)
	(on crate0 pallet8)
	(at crate1 distributor1)
	(on crate1 pallet7)
	(at crate2 distributor1)
	(on crate2 crate1)
	(at crate3 depot2)
	(on crate3 pallet2)
)

(:goal (and
		(on crate1 pallet7)
		(on crate2 pallet8)
		(on crate3 pallet5)
	)
))

; plan
1. (lift hoist7 crate2 crate1 distributor1)
   deleted: (at crate2 distributor1) (available hoist7) (on crate2 crate1) (clear crate2)
   added: (lifting hoist7 crate2) (clear crate1)
   goals met: 1 of 3
2. (load hoist7 crate2 truck2 distributor1)
   deleted: (lifting hoist7 crate2)
   added: (in crate2 truck2) (available hoist7)
   goals met: 1 of 3
3. (lift hoist8 crate0 pallet8 distributor2)
   deleted: (at crate0 distributor2) (available hoist8) (on crate0 pallet8) (clear crate0)
   added: (lifting hoist8 crate0) (clear pallet8)
   goals met: 1 of 3
4. (drive truck2 distributor1 distributor2)
   deleted: (at truck2 distributor1)
   added: (at truck2 distributor2)
   goals met: 1 of 3
5. (load hoist8 crate0 truck2 distributor2)
   deleted: (lifting hoist8 crate0)
   added: (in crate0 truck2) (available hoist8)
   goals met: 1 of 3
6. (unload hoist8 crate2 truck2 distributor2)
   deleted: (available hoist8) (in crate2 truck2)
   added: (lifting hoist8 crate2)
   goals met: 1 of 3
7. (lift hoist2 crate3 pallet2 depot2)
   deleted: (at crate3 depot2) (available hoist2) (on crate3 pallet2) (clear crate3)
   added: (lifting hoist2 crate3) (clear pallet2)
   goals met: 1 of 3
8. (drive truck0 distributor0 depot2)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot2)
   goals met: 1 of 3
9. (load hoist2 crate3 truck0 depot2)
   deleted: (lifting hoist2 crate3)
   added: (in crate3 truck0) (available hoist2)
   goals met: 1 of 3
10. (drop hoist8 crate2 pallet8 distributor2)
   deleted: (lifting hoist8 crate2) (clear pallet8)
   added: (at crate2 distributor2) (available hoist8) (on crate2 pallet8) (clear crate2)
   goals met: 2 of 3
11. (drive truck0 depot2 depot5)
   deleted: (at truck0 depot2)
   added: (at truck0 depot5)
   goals met: 2 of 3
12. (unload hoist5 crate3 truck0 depot5)
   deleted: (available hoist5) (in crate3 truck0)
   added: (lifting hoist5 crate3)
   goals met: 2 of 3
13. (drop hoist5 crate3 pallet5 depot5)
   deleted: (lifting hoist5 crate3) (clear pallet5)
   added: (at crate3 depot5) (available hoist5) (on crate3 pallet5) (clear crate3)
   goals met: 3 of 3
